BDD-Cucumber/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
     id = params[:id]
     begin
     @movie = Movie.find(id)